---
kind: enumMember
id: F:Autodesk.Revit.DB.Visual.GradientType.Lighting
enum: Autodesk.Revit.DB.Visual.GradientType
source: html/24840051-8de9-699a-be97-4803c5aff530.htm
---
# Autodesk.Revit.DB.Visual.GradientType.Lighting